{
    "projects" : [
        {
            "title": "Pet Clinic",
            "bodyText": "- Microservice based business application for a pet clinic which is divided into teams, requiring communication and teamwork to have it all come together.\n -  Fully customisable and dynamic, easily change data and images.\n - Was responsible for the service of billing within the microservice, troubleshooting, updating, debugging issues, working with front-end and back-end.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/AToner25/champ_petclinic.git"
                }
            ],
            "tags" : [
                "HTML",
                "CSS",
                "Java",
                "Bootstrap",
                "Git Bash",
                "Angular",
                "Jira"
            ]
        },
        {
            "title": "Halal Bites",
            "bodyText": "- Website/microservice based system for halal/kosher restaurants owners to easily have clients go to one location to find them. \n - We were in constant contact with our product owner for this project, who told us exactly what he wanted it to do and look like. \n - The responsiblity of our tasks were seperated in a variety of ways during this project. Each memeber of the team had to have done a full stack story by the end of each sprint during development.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/Nmazza1/HalalbitesBackend.git"
                }
            ],
            "tags" : [
                "Java",
                "React",
                "Vercel",
                "Sql",
                "JavaScript",
                "Jira",
                "Git Bash"
            ]
        },
        {
            "title": "My Portfolio",
            "bodyText": "- Website based application focus on front-end, developed using React, CSS and HTML. \n - A minimalist design that best represents me, and the beginning of my journey in the industry. \n - The concept behind my design is that as I grow in the industry so will my portfolio, this will be a on going project of mine.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/AToner25/MyPortfolio.git"
                }
            ],
            "tags" : [
                "React",
                "CSS",
                "HTML",
                "Vercel"
            ]
        }
        
    ]
}